%动力减速阶段3-4
function [ind4,T4,X4t,Y4t,Vx4t,Vy4t]=dongli(T3,t4_,X3,Y3,Vx3,Vy3)
%%输入
%T3-伞系速阶段结束时间
%t4_ -第三阶段消耗时间，需更新
%X3-从开始降落到伞系减速末端在x轴方向位移
%Y3-从开始降落到伞系减速末端在x轴方向位移
%Vx3-伞系减速阶段结束x轴方向速度
%Vy3-伞系减速阶段结束y轴方向速度
%%输出
%t4-此阶段时间变化[后期可考虑去掉]
%T4-从开始降落到此阶段结束的时间
%r4t-此阶段探测器距离火心的距离
%fai4t-此阶段探测器与火心连线与y轴正向夹角变化
%V4t-此阶段探测器速度变化
%theta4t-此阶段速度角的变化
R=3397000;
[t4,x4]=ode45('dongli_dx',(0:0.01:t4_),[X3,Y3,Vx3,Vy3]);%初始状态为伞系减速末端
%%位移
X4t=x4(:,1);
Y4t=x4(:,2);
r4t=sqrt(X4t.^2+Y4t.^2);%第四阶段速阶段探测器距离火心距离
fai4t=atan(X4t/Y4t);%第四阶段探测器位移角
%%速度
Vx4t=x4(:,3);
Vy4t=x4(:,4);
V4t=sqrt(Vx4t.^2+Vy4t.^2);%第四阶段降落轨迹上任一点与y轴正向夹角
theta4t=atan(Vy4t/Vx4t);%第四阶段速度与x轴正向角
%%时间
  ind4_=find(abs(r4t-R)<100);
%   for i=1:size(ind4_,1)
%      if(V4t((ind4_(i)))<240)
%           ind4=ind4_(i);
%           break;
%       end
%   end
ind4=min(ind4_);
  T4=T3+(ind4/100);
end