%伞系减速阶段2-3
function [ind3,T3,X3t,Y3t,Vx3t,Vy3t]=sanxi(T2,t3_,X2,Y2,Vx2,Vy2)
%%输入
%T2-气动减速阶段结束时间
%t3_ -第三阶段消耗时间，需更新
%X2-从开始降落到气动减速末端在x轴方向位移
%Y2-从开始降落到气动减速末端在x轴方向位移
%Vx1-着陆准备阶段结束x轴方向速度
%Vy1-着陆准备阶段结束y轴方向速度
%%输出
%t3-此阶段时间变化[后期可考虑去掉]
%T3-从开始降落到此阶段结束的时间
%r3t-此阶段探测器距离火心的距离
%fai3t-此阶段探测器与火心连线与y轴正向夹角变化
%V3t-此阶段探测器速度变化
%theta3t-此阶段速度角的变化

[t3,x3]=ode45('sanxi_dx',(0:t3_),[X2,Y2,Vx2,Vy2]);%初始状态为伞系减速末端
%%位移
X3t=x3(:,1);
Y3t=x3(:,2);
r3t=sqrt(X3t.^2+Y3t.^2);%第三阶段速阶段探测器距离火心距离
fai3t=atan(X3t/Y3t);%第三阶段探测器位移角
%%速度
Vx3t=x3(:,3);
Vy3t=x3(:,4);
V3t=sqrt(Vx3t.^2+Vy3t.^2);%第三阶段降落轨迹上任一点与y轴正向夹角
theta3t=atan(Vy3t./Vx3t);%第一阶段速度与x轴正向角
%%时间
ind3_=find(abs(V3t-150)<50);
if isempty(ind3_)
    ind3=0;
else
    ind3=max(ind3_);
T3=T2+ind3;
end

end